In [18]:
import os
import sys
import datetime

import pandas as pd
import numpy as np

# 28 Jupyter Notebook tips, tricks and shortcuts
# https://www.dataquest.io/blog/jupyter-notebook-tips-tricks-shortcuts/

# Jupyter Python Notebook Keyboard Shortcuts and Text Snippets for Beginners
# http://maxmelnick.com/2016/04/19/python-beginner-tips-and-tricks.html

In [5]:
print("USING PANDAS LIBRARY FOR DATA MANIPULATION AND CLEANSING:")
print()

USING PANDAS LIBRARY FOR DATA MANIPULATION AND CLEANSING:

In [17]:
df_input_file = pd.read_csv(filepath_or_buffer=r"C:\Users\rdewolf\desktop\input_data.csv", sep=",", encoding="latin1")    
print("PANDAS DATA FRAME FOR INPUT FILE :")
print(df_input_file)
print()

PANDAS DATA FRAME FOR INPUT FILE :
   one  two  three   four   five       six    seven eight
0  NaN  2.1    3.1    bar   True       NaN  £200.45   BMC
1  NaN  NaN    3.2    NaN  False  1/1/2017  £650.38   ACS
2  3.0  2.3    3.3   club   True  2/1/2017   £85.07   ACS
3  5.0  2.4    NaN    bar    NaN  3/1/2017      NaN   BPS
4  NaN  2.5    3.5    bar  False       NaN  £230.22   BMC
5  6.0  NaN    3.3   club   True  2/1/2017  £650.96   CJS
6  2.0  2.5    NaN  house    NaN  4/1/2017      NaN    FM
7  3.0  2.3    3.3   club   True  2/1/2017   £85.07   ACS

In [16]:
result = df_input_file.shape
print("NUMBER OF ROWS AND COLUMNS:")
print(result)
print()

NUMBER OF ROWS AND COLUMNS:
(8, 8)

In [15]:
print("FILE INFORMATION:")
df_input_file.info()
print()

FILE INFORMATION:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 8 columns):
one      5 non-null float64
two      6 non-null float64
three    6 non-null float64
four     7 non-null object
five     6 non-null object
six      6 non-null object
seven    6 non-null object
eight    8 non-null object
dtypes: float64(3), object(5)
memory usage: 592.0+ bytes

In [19]:
result = df_input_file.describe()
print("SUMMARY DESCRIPTIVE STATS FOR NUMERICAL COLUMNS:")
print(result)
print()

SUMMARY DESCRIPTIVE STATS FOR NUMERICAL COLUMNS:
            one       two     three
count  5.000000  6.000000  6.000000
mean   3.800000  2.350000  3.283333
std    1.643168  0.151658  0.132916
min    2.000000  2.100000  3.100000
25%    3.000000  2.300000  3.225000
50%    3.000000  2.350000  3.300000
75%    5.000000  2.475000  3.300000
max    6.000000  2.500000  3.500000

In [20]:
result = df_input_file["four"].value_counts()
print("FREQUENCY DISTRIBUTION FOR CATEGORICAL COLUMN FOUR:")
print(result)
print()

FREQUENCY DISTRIBUTION FOR CATEGORICAL COLUMN FOUR:
bar      3
club     3
house    1
Name: four, dtype: int64

In [21]:
result = df_input_file["eight"].value_counts()
print("FREQUENCY DISTRIBUTION FOR CATEGORICAL COLUMN EIGHT:")
print(result)
print()

FREQUENCY DISTRIBUTION FOR CATEGORICAL COLUMN EIGHT:
ACS    3
BMC    2
FM     1
CJS    1
BPS    1
Name: eight, dtype: int64

In [22]:
result = df_input_file.apply(lambda x: sum(x.isnull()), axis=0) 
print("MISSING VALUES (NAN) BY COLUMNS:")
print(result)
print()

MISSING VALUES (NAN) BY COLUMNS:
one      3
two      2
three    2
four     1
five     2
six      2
seven    2
eight    0
dtype: int64

In [23]:
result = df_input_file.duplicated()
print("DUPLICATED ROWS:")
print(result)       
print()

DUPLICATED ROWS:
0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [24]:
df_input_file = df_input_file.drop_duplicates(keep="first")
print("DROP DUPLICATED ROWS AND KEEP THE FIRST:")
print(df_input_file)       
print()

DROP DUPLICATED ROWS AND KEEP THE FIRST:
   one  two  three   four   five       six    seven eight
0  NaN  2.1    3.1    bar   True       NaN  £200.45   BMC
1  NaN  NaN    3.2    NaN  False  1/1/2017  £650.38   ACS
2  3.0  2.3    3.3   club   True  2/1/2017   £85.07   ACS
3  5.0  2.4    NaN    bar    NaN  3/1/2017      NaN   BPS
4  NaN  2.5    3.5    bar  False       NaN  £230.22   BMC
5  6.0  NaN    3.3   club   True  2/1/2017  £650.96   CJS
6  2.0  2.5    NaN  house    NaN  4/1/2017      NaN    FM

In [25]:
df_input_file = df_input_file.fillna(df_input_file.mean()["one":"two"], inplace=True)
print("REPLACE NAN VALUES WITH THE MEAN VALUE IN COLUMNS ONE AND TWO:")
print(df_input_file)       
print()

REPLACE NAN VALUES WITH THE MEAN VALUE IN COLUMNS ONE AND TWO:
   one   two  three   four   five       six    seven eight
0  4.0  2.10    3.1    bar   True       NaN  £200.45   BMC
1  4.0  2.36    3.2    NaN  False  1/1/2017  £650.38   ACS
2  3.0  2.30    3.3   club   True  2/1/2017   £85.07   ACS
3  5.0  2.40    NaN    bar    NaN  3/1/2017      NaN   BPS
4  4.0  2.50    3.5    bar  False       NaN  £230.22   BMC
5  6.0  2.36    3.3   club   True  2/1/2017  £650.96   CJS
6  2.0  2.50    NaN  house    NaN  4/1/2017      NaN    FM

In [26]:
df_input_file = df_input_file.fillna(df_input_file.median()[:"three"], inplace=True)
print("REPLACE NAN VALUES WITH THE MEDIAN VALUE IN COLUMN THREE:")
print(df_input_file)       
print()

REPLACE NAN VALUES WITH THE MEDIAN VALUE IN COLUMN THREE:
   one   two  three   four   five       six    seven eight
0  4.0  2.10    3.1    bar   True       NaN  £200.45   BMC
1  4.0  2.36    3.2    NaN  False  1/1/2017  £650.38   ACS
2  3.0  2.30    3.3   club   True  2/1/2017   £85.07   ACS
3  5.0  2.40    3.3    bar    NaN  3/1/2017      NaN   BPS
4  4.0  2.50    3.5    bar  False       NaN  £230.22   BMC
5  6.0  2.36    3.3   club   True  2/1/2017  £650.96   CJS
6  2.0  2.50    3.3  house    NaN  4/1/2017      NaN    FM

In [ ]:
df_input_file["four"] = df_input_file["four"].fillna("club")    
print("REPLACE NAN VALUES WITH THE 'CLUB' STRING IN COLUMN FOUR:")
print(df_input_file)       
print()

In [31]:
print("PRINT THE DATA FRAME IN A TABLE:")
df_input_file.head(10)

PRINT THE DATA FRAME IN A TABLE:

   one   two  three   four   five       six    seven eight
0  4.0  2.10    3.1    bar   True       NaN  £200.45   BMC
1  4.0  2.36    3.2    NaN  False  1/1/2017  £650.38   ACS
2  3.0  2.30    3.3   club   True  2/1/2017   £85.07   ACS
3  5.0  2.40    3.3    bar    NaN  3/1/2017      NaN   BPS
4  4.0  2.50    3.5    bar  False       NaN  £230.22   BMC
5  6.0  2.36    3.3   club   True  2/1/2017  £650.96   CJS
6  2.0  2.50    3.3  house    NaN  4/1/2017      NaN    FM

In [32]:
df_input_file["five"] = df_input_file["five"].fillna(True)
print("REPLACE NAN VALUES WITH THE TRUE BOOLEAN IN COLUMN FIVE:")
print(df_input_file)       
print()

REPLACE NAN VALUES WITH THE TRUE BOOLEAN IN COLUMN FIVE:
   one   two  three   four   five       six    seven eight
0  4.0  2.10    3.1    bar   True       NaN  £200.45   BMC
1  4.0  2.36    3.2    NaN  False  1/1/2017  £650.38   ACS
2  3.0  2.30    3.3   club   True  2/1/2017   £85.07   ACS
3  5.0  2.40    3.3    bar   True  3/1/2017      NaN   BPS
4  4.0  2.50    3.5    bar  False       NaN  £230.22   BMC
5  6.0  2.36    3.3   club   True  2/1/2017  £650.96   CJS
6  2.0  2.50    3.3  house   True  4/1/2017      NaN    FM

In [33]:
now = datetime.datetime.now().strftime("%m/%d/%Y")
df_input_file["six"] = df_input_file["six"].fillna(str(now))
df_input_file["six"] = pd.to_datetime(df_input_file["six"])    
print("REPLACE NAN VALUES WITH THE CURRENT DATE IN COLUMN SIX:")
print(df_input_file)       
print()

REPLACE NAN VALUES WITH THE CURRENT DATE IN COLUMN SIX:
   one   two  three   four   five        six    seven eight
0  4.0  2.10    3.1    bar   True 2017-12-02  £200.45   BMC
1  4.0  2.36    3.2    NaN  False 2017-01-01  £650.38   ACS
2  3.0  2.30    3.3   club   True 2017-02-01   £85.07   ACS
3  5.0  2.40    3.3    bar   True 2017-03-01      NaN   BPS
4  4.0  2.50    3.5    bar  False 2017-12-02  £230.22   BMC
5  6.0  2.36    3.3   club   True 2017-02-01  £650.96   CJS
6  2.0  2.50    3.3  house   True 2017-04-01      NaN    FM

In [34]:
df_input_file["seven"] = df_input_file["seven"].fillna("£0.0")
print("REPLACE NAN VALUES WITH THE  £0.0 IN COLUMN SEVEN:")
print(df_input_file)       
print()

REPLACE NAN VALUES WITH THE  £0.0 IN COLUMN SEVEN:
   one   two  three   four   five        six    seven eight
0  4.0  2.10    3.1    bar   True 2017-12-02  £200.45   BMC
1  4.0  2.36    3.2    NaN  False 2017-01-01  £650.38   ACS
2  3.0  2.30    3.3   club   True 2017-02-01   £85.07   ACS
3  5.0  2.40    3.3    bar   True 2017-03-01     £0.0   BPS
4  4.0  2.50    3.5    bar  False 2017-12-02  £230.22   BMC
5  6.0  2.36    3.3   club   True 2017-02-01  £650.96   CJS
6  2.0  2.50    3.3  house   True 2017-04-01     £0.0    FM

In [35]:
df_input_file["seven"] = df_input_file["seven"].map(lambda x: str(x)[1:])
print("REMOVE THE FIRST CHARACTER (ENGLAND POUND SYMBOL) IN COLUMN SEVEN:")
print(df_input_file)       
print()

REMOVE THE FIRST CHARACTER (ENGLAND POUND SYMBOL) IN COLUMN SEVEN:
   one   two  three   four   five        six   seven eight
0  4.0  2.10    3.1    bar   True 2017-12-02  200.45   BMC
1  4.0  2.36    3.2    NaN  False 2017-01-01  650.38   ACS
2  3.0  2.30    3.3   club   True 2017-02-01   85.07   ACS
3  5.0  2.40    3.3    bar   True 2017-03-01     0.0   BPS
4  4.0  2.50    3.5    bar  False 2017-12-02  230.22   BMC
5  6.0  2.36    3.3   club   True 2017-02-01  650.96   CJS
6  2.0  2.50    3.3  house   True 2017-04-01     0.0    FM

In [36]:
df_input_file["eight"].replace(to_replace=dict(BMC="BioMed Central", ACS="Amercian Chemical Society", BPS="Biophysical Society", CJS="Cadmus Journal Services", FM="Frontiers Media"), inplace=True)
print("SUBSTITUTE THE ABBREVIATION IN COLUMN EIGHT:")
print(df_input_file)       
print()

SUBSTITUTE THE ABBREVIATION IN COLUMN EIGHT:
   one   two  three   four   five        six   seven  \
0  4.0  2.10    3.1    bar   True 2017-12-02  200.45
1  4.0  2.36    3.2    NaN  False 2017-01-01  650.38
2  3.0  2.30    3.3   club   True 2017-02-01   85.07
3  5.0  2.40    3.3    bar   True 2017-03-01     0.0
4  4.0  2.50    3.5    bar  False 2017-12-02  230.22
5  6.0  2.36    3.3   club   True 2017-02-01  650.96
6  2.0  2.50    3.3  house   True 2017-04-01     0.0

                       eight
0             BioMed Central
1  Amercian Chemical Society
2  Amercian Chemical Society
3        Biophysical Society
4             BioMed Central
5    Cadmus Journal Services
6            Frontiers Media

In [45]:
x = df_input_file.drop(labels="eight", axis=1)
print("X: LABELS (DataFrame)")
print(x)
print()

X: LABELS (DataFrame)
   one   two  three   four   five        six   seven
0  4.0  2.10    3.1    bar   True 2017-12-02  200.45
1  4.0  2.36    3.2    NaN  False 2017-01-01  650.38
2  3.0  2.30    3.3   club   True 2017-02-01   85.07
3  5.0  2.40    3.3    bar   True 2017-03-01     0.0
4  4.0  2.50    3.5    bar  False 2017-12-02  230.22
5  6.0  2.36    3.3   club   True 2017-02-01  650.96
6  2.0  2.50    3.3  house   True 2017-04-01     0.0

In [46]:
df_input_file.to_csv(r"C:\Users\Ernest\git\test-code\test-code\src\utica_college_ipython\output_data.csv", encoding="latin1")   
print("THE OUTPUT FILE HAD BEEN CREATED SUCCESSFULLY:")
print("output_data.csv")
print()

THE OUTPUT FILE HAD BEEN CREATED SUCCESSFULLY:
output_data.csv